// Опишіть, як можна створити новий HTML тег на сторінці.
// через insertAdjacentHTML, але прив'язати його до батьківського тегу 
// через createElement, де треба присвоїти текст та клас й вставити його у батьківський елемент
// Опишіть, що означає перший параметр функції insertAdjacentHTML і опишіть можливі варіанти цього параметра.
// відповідає за те куди буде вставлений новий тег по відношенню до батьківського тегу
// "beforeend", "beforebegin", "afterend", "afterbegin"
// Як можна видалити елемент зі сторінки?
// element.remove("")
// Завдання

// Реалізувати функцію, яка отримуватиме масив елементів і виводити їх на сторінку у вигляді списку. 
//Завдання має бути виконане на чистому Javascript без використання бібліотек типу jQuery або React.

// Технічні вимоги:
// Створити функцію, яка прийматиме на вхід масив і опціональний другий аргумент parent - DOM-елемент,
// до якого буде прикріплений список (по дефолту має бути document.body.
// кожен із елементів масиву вивести на сторінку у вигляді пункту списку;
// Приклади масивів, які можна виводити на екран:

// ["hello", "world", "Kiev", "Kharkiv", "Odessa", "Lviv"];
// ["1", "2", "3", "sea", "user", 23];
// Можна взяти будь-який інший масив.

const parent = document.createElement("div")
const mass = ["hello", "world", "Kiev", "Kharkiv", "Odessa", "Lviv"]
function render(mass, parent = document.body){
parent.insertAdjacentHTML("beforeend", `<ul>${mass.map(item => {
    return `<li>${item}</li>`
}).join("")}</ul>`)
}
render(mass)
document.body.append(parent)